
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:simple_html_css/simple_html_css.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({Key? key}) : super(key: key);
  @override
  Widget build(BuildContext context) {
    String html = '''<p style="text-align: center;"><span style="color: #ffcc00;"><strong>سياسة الخصوصية</strong></span></p>
<p style="text-align: center;"><span style="color: #ffcc00;">موقع caphore.sy</span></p>
<p><span style="color: #ffcc00;"><strong>مقدمة</strong></span></p>
<p>موقع caphore.sy</p>
<p>يحترم حقك في الخصوصية، ويسعى دائمًا لجمع بياناتكم الشخصية والتعامل عليها بشكل عادل وقانوني، وتوضح هذه السياسة كافة الممارسات التي تتم على بياناتكم، ويعد استخدامك للموقع أو دخولك معنا في اتفاقية تقديم الخدمات موافقة صريحة منك على هذه الاتفاقية.</p>
<p style="text-align: center;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; -----------------------------</p>
<p style="text-align: center;">&nbsp;<strong><span style="color: #ffcc00;">أولاً: التعريفات</span></strong></p>
<p>&nbsp;في هذه الاتفاقية، وما لم يقتضي السياق خلاف ذلك يكون للمصطلحات التالية المعاني المشار إليها. <span style="color: #ffcc00;"><strong>"الموقع" أو "المتجر" أو "نحن" أو "ضمير المتكلم" أو "ضمير الملكية":</strong></span>&nbsp;يشير إلى موقع caphore.sy وشركة كافور في الجمهورية العربية السورية. <span style="color: #ffcc00;"><strong>"المستخدم" أو "أنت" أو "ضمير الملكية للمخاطب":</strong></span>&nbsp;يعني الشخص الذي يزور الموقع، أو يستخدمه، أو يدخل معنا في اتفاقية تقديم الخدمات. <strong>"<span style="color: #ffcc00;">الخدمات</span>"</strong>&nbsp;تشير إلى كافة الخدمات المقدمة عبر الموقع. <strong>"<span style="color: #ffcc00;">السياسة</span>"</strong>&nbsp;تشير إلى هذه الوثيقة وما تتضمنه من شروط وأحكام. <strong>"<span style="color: #ffcc00;">البيانات الشخصية</span>"</strong>&nbsp;تشير إلى كافة البيانات التي يتم جمعها عن المستخدم أثناء استخدامه للموقع، أو تلك التي يقوم المستخدم بتزويدنا بها في أي وقت من الأوقات، والتي تشمل على سبيل المثال لا الحصر (الاسم، العمر، العنوان، رقم الجوال). <strong>"<span style="color: #ffcc00;">بيانات الاستخدام</span>"</strong>&nbsp;تشير إلى كافة بيانات الحاسب الآلي أو الهاتف الجوال الخاص بك، والتي يتم جمعها تلقائيًا بمجرد استخدام الموقع. <strong>"<span style="color: #ffcc00;">البيانات</span>"</strong>&nbsp;تشير إلى البيانات الشخصية وبيانات الاستخدام التي تم تعريفها آنفًا. <span style="color: #ffcc00;"><strong>ثانيًا: البيانات التي نقوم بجمعها عنك</strong></span></p>
<p>&nbsp;قد يقوم موقع <span style="color: #ffcc00;">caphore.sy</span> بجمع ومعالجة بعض البيانات الخاصة بك، وذلك على النحو الآتي:</p>
<ol>
<li>البيانات الشخصية التي تقوم بتزويدنا بها أثناء التواصل معك عبر الموقع، لأي سبب من الأسباب.</li>
<li>البيانات الشخصية التي تقوم بتزويدنا بها بخصوص طلب تقديم الخدمات، أو أثناء دخولك معنا في اتفاقية تقديم الخدمة.</li>
<li>البيانات التي تقدمها لنا بمناسبة دخولك معنا في اتفاقية تقديم الخدمات كالعنوان، واسمك الكامل، ورقم هويتك وغيرها من البيانات اللازمة لعملية تقديم الخدمات.</li>
<li>البيانات الشخصية التي تقوم بتزويدنا بها أثناء الترويج للخدمات وتقديم العروض عبر الموقع.</li>
<li>البيانات الشخصية التي تقوم بتزويدنا بها عند الإبلاغ عن مشكلة واجهتك أثناء استخدامك للموقع.</li>
<li>البيانات التي تقدمها لنا أثناء قيامك بتقييم الخدمات التي تلقيتها عبر موقعنا.</li>
</ol>
<p><span style="color: #ffcc00;"><strong>ثالثًا: ملفات تعريف الارتباط (سياسة الكوكيز)</strong></span></p>
<p>ملفات تعريف الارتباط "الكوكيز" هي ملفات نصية صغيرة يتم تخزينها على الحاسب الآلي الخاص بك بمجرد زيارتك للموقع، والتي لا تظهر في صورة برنامج ولا تحمل فيروسات أو تقنيات تجسس على الإطلاق، وتستخدم هذه الملفات للأغراض الآتية:</p>
<ol>
<li>تستخدم ملفات تعريف الارتباط بغرض تقديم المعلومات، فعلى سبيل المثال في الموقع تساعدنا بعض ملفات تعريف الارتباط التي نستخدمها على تحديد الأخطاء وإصلاحها.</li>
<li>تساعدك الكوكيز على إيجاد المعلومات التي تحتاجها أثناء استخدامك للموقع.</li>
<li>تساعد بعض ملفات تعريف الارتباط على تذكر الصفحات والنماذج التي تشاهدها عند زيارتك لموقعنا.</li>
<li>تهدف ملفات تعريف الارتباط إلى تحسين تجربة الموقع في كل مرة تزوره.</li>
<li>هناك ملفات ارتباط لصفحات منشورة عبر موقعنا غير تابعة لنا، كمحتوى الصفحات الخاصة بموقع فايس بوك&nbsp;Facebook، وأنت تعلم وتوافق أننا لا نتحكم بملفات تعريف الارتباط الخاصة بمثل هذه المواقع وعليك الدخول على هذه المواقع والاطلاع على السياسات التي يتبعونها.</li>
</ol>
<p><span style="color: #ffcc00;"><strong>رابعًا: حدود استخدام بياناتك الشخصية</strong></span></p>
<p>&nbsp;نحن ملتزمون دائمًا بحماية خصوصيتك، وبالتالي فنحن نستخدم بياناتك الشخصية للأغراض الآتية:</p>
<ol>
<li>لتمكينك من شراء المنتجات واستخدام خدماتنا على النحو الأمثل، وتقديم الأفضل لك دائمًا.</li>
<li>لمعالجة البيانات التي تقدمها عبر خدماتنا كالتأكد من أن بريدك الالكتروني أو رقم هاتفك نشط وصالح للاستخدام ومملوك لك.</li>
<li>لتقديم الخدمات لك والتواصل معك لتحديد مكان إقامتك، ومتابعة تلك العملية حتى تمامها.</li>
<li>للتواصل في حدود سياسة الاسترجاع الخاصة بنا ومعالجة طلب الاسترجاع الخاص بك، والرد عليه.</li>
<li>لتلقي الأسئلة والشكاوى والاستفسارات منك، والرد عليها.</li>
<li>لتلقي تعليقاتك وتقييمك للخدمة التي تلقيتها من خلال موقعنا، والرد عليها.</li>
<li>لمعالجة إجاباتك على الاستبيانات المطروحة عبر الموقع والتي شاركت في الإجابة عليها.</li>
<li>لتزويدك بالمعلومات عن المنتجات والخدمات التي تطلبها عبر موقعنا.</li>
<li>لتزويدك بالمعلومات عن المنتجات التي نعتقد أنها تثير اهتمامك بما في ذلك العروض الخاصة بنا.</li>
<li>لتخصيص المحتوى والتوصيات والإعلانات التي نقدمها نحن والأطراف الثالثة لك، سواء على الخدمات أو في أي مكان آخر على شبكة الانترنت.</li>
<li>لإدارة ومعالجة المسابقات والعروض الترويجية.</li>
<li>للاتصال بك بشأن الاتصالات الحكومية، ووفقًا لتقديرنا الخاص، بخصوص التغييرات في سياسة الخصوصية أو شروط الاستخدام أو أي من سياستنا الأخرى.</li>
<li>للامتثال للالتزامات التنظيمية والقانونية.</li>
</ol>
<p><span style="color: #ffcc00;"><strong>خامسًا: ضمانات الموقع لحماية بيانات المستخدم</strong></span></p>
<ol>
<li>يتعهد الموقع بالاحتفاظ ببياناتك الشخصية للمدة التي تقتضيها طبيعة المعاملة التي تقوم بها عبر الموقع.</li>
<li>يتعهد الموقع بعدم التعامل على بياناتك الشخصية لأغراض غير مصرح أو مسموح بها بمقابل أو بدون مقابل مع أي جهة أخرى إلا إذا كان ذلك مطلوبًا منا أو مصرحًا به بموجب الأنظمة والتعليمات ذات العلاقة، أو بموافقة كتابية مسبقة من المستخدم الذي تتعلق به المعلومات.</li>
<li>يتعهد الموقع بالحفاظ على السجلات التي تحتوي على البيانات الشخصية للمستخدم أو أي سجلات للاتصالات الالكترونية، تكون في عهدتنا أو تحت سيطرتنا أو مع وكلائنا أو منسوبينا.</li>
<li>يتعهد الموقع باتخاذ الخطوات المعقولة، لضمان أن البيانات الشخصية للمستخدم، والسجلات ذات الصلة، محمية بطريقة أمنية تناسب أهميتها.</li>
<li>نتعهد بحماية خصوصيتك في جميع الأوقات، وأننا لن نبيع أبدًا بياناتك الشخصية، أو نسمح بتداولها مع الغير.</li>
</ol>
<p><span style="color: #ffcc00;"><strong>سادسًا: الإفصاح عن بياناتك الشخصية</strong></span></p>
<ol>
<li>أنت تعلم وتوافق على أن الانترنت ليس وسيلة آمنة، وأن سرية بياناتك لا يمكن أن تكون مضمونة بشكل كامل.</li>
<li>نحن من جانبنا نتعهد في حدود المسموح به قانونًا بعدم الكشف عن بياناتك السرية أو استخدامها بشكل يتعارض وحقك في الخصوصية.</li>
<li>نتعهد بعدم تداول بياناتك الخاصة بك أو بيعها للغير، ولكنك تمنحنا الحق في السماح للموظفين لدينا بالتعامل مع بياناتكم الشخصية في حدود تقديم الخدمات.</li>
<li>يجوز لنا الكشف عن بياناتك الشخصية لأي عضو في مجموعتنا؛ وهو ما يعني فروعنا ومؤسساتنا.</li>
<li>قد نكشف بياناتك الشخصية لأطراف ثالثة:
<ul>
<li>في حالة قيامنا ببيع أصول من شركة كافور التجارية، أو دخول شركاء معنا، فهنا نقوم بالكشف عن بياناتكم للمشتري أو الشريك الجديد.</li>
<li>الجهات التي تشاركنا تقديم الخدمات للحماية من مخاطر الائتمان وعمليات الاحتيال والقرصنة الالكترونية.</li>
<li>إذا كنا مطالبين بالإفصاح عن بياناتك الشخصية أو مشاركتها من أجل حماية الحقوق والملكية أو سلامة الموقع أو موظفينا أو الآخرين.</li>
</ul>
</li>
<li>قد نكشف بياناتك الشخصية للامتثال للالتزامات القانونية أو التعاقدية في الأحوال الآتية:
<ul>
<li>إذا كنا مطالبين بالإفصاح عن بياناتك الشخصية أو مشاركتها من أجل الامتثال لأي التزام قانوني أو من أجل فرض أو تطبيق شروطنا وأحكامنا أو أي اتفاقية أخرى.</li>
<li>في حالة صدور حكم قضائي أو قرار من الجهات القضائية المختصة يلزمنا بذلك.</li>
<li>في حالة صدور قرار من السلطات العامة يلزمنا بذلك.</li>
</ul>
</li>
</ol>
<p><span style="color: #ffcc00;"><strong>سابعًا: التزامات المستخدم</strong></span></p>
<ol>
<li>يلتزم أطراف هذه الاتفاقية بالمحافظة على سرية وخصوصية بياناتهم الشخصية، ويقرون وعلى مسئوليتهم الشخصية بأن إفصاح أيًا منهم عن البيانات الشخصية للطرف الآخر يكون على مسئوليته دون أي تدخل منا، ودون أي مسئولية علينا.</li>
<li>يلتزم الأطراف بعدم الإفصاح عن أي بيانات شخصية خلال استخدام خاصية الرسائل داخل الموقع، وأنهم مسئولون مسئولية شخصية عن أي إفصاح من هذا النوع.</li>
<li>تلتزم بالامتناع عن الإفصاح عن أية بيانات متعلقة بتشغيل الموقع إلى الغير سواء بمقابل أو بدون مقابل.</li>
<li>تلتزم بالمحافظة على سرية كافة البيانات المتعلقة بتفاصيل المعاملات عبر الموقع، وعدم استخدامها بأي شكل كان، وتعد مسئولاً مسئولية عقدية وقانونية عن أي استخدام غير مشروع أو غير مصرح به لهذه البيانات.</li>
<li>أنت تقر بتجنب إتباع أي وسيلة من شأنها أن تساعد على جمع البيانات عن المستخدمين الآخرين، بما في ذلك البريد الالكتروني وأرقام الجوال ووسائل الاتصال الأخرى الخاصة بهم.</li>
</ol>
<p><span style="color: #ffcc00;"><strong>ثامنًا: التعديلات</strong></span></p>
<ol>
<li>يحق لنا تعديل هذه السياسة في أي وقت من الأوقات.</li>
<li>في حالة قيامنا بتعديل هذه السياسة سنقوم بنشر إشعار عبر الموقع، ويفترض علمك بهذه التعديلات بمجرد نشر الإشعار عبر الموقع.</li>
<li>إن استمرارك في استخدام الموقع يعني أنك موافق على التعديلات والتحديثات التي قمنا بها.</li>
</ol>''';
    return SafeArea(
      child: Scaffold(
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.symmetric(horizontal: 5.w,vertical: 10.h),
            child: RichText(
              text: HTML.toTextSpan(context,html),
              //...
            ),
          ),
        ),
      ),
    );
  }
}
