import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:simple_html_css/simple_html_css.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    String html = '''<p style="text-align: center;"><strong>الشروط والأحكام</strong><strong> caphore.sy </strong></p>
<span style="color: #ffcc00;"><strong>الشروط والأحكام</strong></span>

مرحبًا بكم في موقع "كافور".

يقدم موقع كافور كوسيط إلكتروني لبيع المنتجات من أصحاب الشركات والمحلات التجارية مثل (الإكسسوارات، الشنط، العناية والتجميل، الملابس، الساعات، النظارات، التغليف، الإلكترونيات، العطور وغيرها من المنتجات المعروضة للبيع عبر الموقع)، وذلك وفق الشروط والأحكام الآتية:

أولاً: التعريفات

ثانيًا: الموافقة والأهلية القانونية

ثالثًا: التوقيع الرقمي

رابعًا: شروط استخدام الموقع

خامسًا: النطاق القانوني لخدماتنا

سادسًا: حقوق التأليف والنشر

سابعًا: العلامات التجارية

ثامنًا: التراخيص الممنوحة

تاسعًا: حدود مسئوليتنا

عاشرًا: المسئولية القانونية لأطراف الاتفاقية

حادي عشر: تحويل الحقوق والالتزامات

ثاني عشر: التعديلات

ثالث عشر: إلغاء الاتفاق

رابع عشر: الضرائب والرسوم

خامس عشر: الاتصالات والإشعارات

سادس عشر: القانون واجب التطبيق والمحاكم المختصة

سابع عشر: الطبيعة القانونية للشروط والأحكام والسياسات

<strong>أولاً: التعريفات</strong>

في هذه الاتفاقية، وما لم يقتضي السياق خلاف ذلك يكون للمصطلحات التالية المعاني المشار إليها.
<strong>"الموقع" أو "المتجر" أو "نحن" أو "ضمير المتكلم" أو "ضمير الملكية":</strong> يشير إلى موقع كافور.

<strong>"المستخدم" أو "أنت" أو "ضمير الملكية للمخاطب":</strong> يعني الشخص الذي يزور الموقع، أو يستخدمه، أو يدخل معنا في اتفاقية البيع.

<strong>"المشتري"</strong> يشير إلى كل شخص أو مؤسسة أو شركة تقوم بطلب شراء المنتجات المعروضة للبيع عبر الموقع.
<strong>"المنتجات"</strong> تشير إلى كافة منتجات الإكسسوارات، الشنط، العناية والتجميل، الملابس، الساعات، النظارات، التغليف، الإلكترونيات، العطور والمنتجات الأخرى المتاحة عبر الموقع.

<strong>"الاتفاقية"</strong> تشير إلى هذه الوثيقة وما تتضمنه من شروط وأحكام، وكذلك سياسة الخصوصية، واتفاقية البيع، وكافة

سياسات تقديم الخدمات، وكافة الاتفاقيات والسياسات المكملة والمنفذة لاتفاقك معنا.
<strong>"ملحقات الاتفاقية"</strong> تتمثل في كافة أوصاف الخدمة التي يتم نشرها على الصفحة الرئيسية للموقع أو الصفحات الفرعية،

وكذلك كافة العقود المكملة لهذه الاتفاقية، والتي تعد جزء لا يتجزأ من هذه الاتفاقية.

<strong>"أطراف الاتفاقية"</strong> يشير إلى كافة الأشخاص الذين يخضعون للشروط والأحكام المنصوص عليها في هذه الاتفاقية، بما تتضمنه من حقوق والتزامات.

<strong>ثانيًا: الموافقة والأهلية القانونية</strong>

تقر بأن لديك الأهلية القانونية اللازمة للإبرام والموافقة على هذه الاتفاقية، وأن لديك الصلاحيات القانونية الكاملة غير المقيدة طبقًا للشروط التالية

<strong>(1) التسجيل كشخص عادي: </strong>
<ol>
 	<li>يشترط في من يستخدم موقع كافور أن يتوافر فيه الأهلية القانونية اللازمة لإبرام العقود، ونحن غير مسئولين عن التحقق من أهلية أيًا من مستخدمي الموقع.</li>
 	<li>باستخدامك خدمات موقع كافور فأنت توافق على هذه الاتفاقية، وتقر بأنك ملزمًا قانونًا بالشروط والأحكام المنصوص عليها في هذه الوثيقة أو تعديلاتها.</li>
</ol>
<strong>(2) التسجيل ككيان تجاري:</strong>

إذا كنت تسجل ككيان تجاري، فانك تقر بأن لديك سلطة إلزام هذا الكيان باتفاقية المستخدم هذه، وأنك والكيان التجاري الذي تمثله سوف تخضعون لجميع القوانين السارية المتعلقة بالتداول عبر شبكة الانترنت.

<strong>ثالثًا: التوقيع الرقمي</strong>

في الخدمات التي لا تتطلب التسجيل يعد استخدامك لهذه الخدمات موافقة صريحة منك على الشروط والأحكام المنصوص عليها في هذه الوثيقة كافة السياسات الأخرى، وتعد ملزمًا قانونًا بها من تاريخ هذا الاستخدام.

<strong>رابعًا</strong><strong>:</strong> <strong>شروط استخدام الموقع</strong>
<ol>
 	<li>خدمات الموقع متوفرة في كافة أنحاء العالم، وأنت تقر وتوافق على أنك مُلزم بكافة الشروط والأحكام المنصوص عليها في هذه الاتفاقية بغض النظر عن الدولة التي تنتمي إليها أو تدخل الموقع من خلالها أو تستقبل خدمات الموقع على أرضها.</li>
 	<li>يتعهد المستخدم بتحري الدقة عند إدخال المعلومات المطلوب إدخالها عند التواصل مع الشركة أو المحل التجاري ويكون مسئولاً عن مراجعة تلك المعلومات بشكل دوري بغرض تصحيحها أو تعديلها أو تجديدها كلما توفرت لديك معلومات جديدة بشأنها، على أن تحتفظ بكافة البيانات والمستندات الدالة على ذلك.</li>
 	<li>يجب أن تكون جميع المعلومات التي تفصح عنها حقيقية ومحدثة وصحيحة وتعبر عنك</li>
 	<li>إذا قدمت معلومات غير صحيحة أو غير دقيقة أو غير متزامنة أو غير كاملة، أو إذا كان لدينا أسباب معقولة للاشتباه في أن هذه المعلومات غير صحيحة أو غير دقيقة أو غير متزامنة أو غير كاملة أو لا تتوافق مع اتفاقية الاستخدام هذه، ودون الإخلال بأي حقوق أخرى بموجب هذه الاتفاقية أو القانون، سوف نقوم بتعليق عضويتك أو إلغائها.</li>
 	<li>يلتزم المستخدم بإخطارنا في حالة اكتشافه لأي استخدام غير قانوني للموقع أو لأي من الخدمات أو طلبات البيع.</li>
 	<li>قد يقترن استخدام موقع "كافور بتوفير خدمات أو محتوى جهات أخرى، والتي لا تخضع لسيطرتنا، وبالتالي فأنت تقر بسريان شروط وأحكام وسياسات خصوصية أخرى على استخدامك لخدمات ومحتوى الجهات غير التابعة لنا.</li>
</ol>
<strong>خامسًا: النطاق القانوني لخدماتنا</strong>
<ol>
 	<li>يعمل الموقع كوسيط الكتروني لبيع المنتجات الخاصة بالشركات أو المحلات التجارية فهو بمثابة الأداة الإعلانية الخاصة بنا، التي ننشر من خلالها كافة المعلومات الخاصة بالمنتجات المعروضة للبيع لتبصير العميل بالمواصفات التي على أساسها يقبل الشراء.</li>
 	<li>لا يعد موقع كافور مزود خدمة انترنت، ولا متعهد إيواء، ولا موفر محتوى معلوماتي، ولا يعامل كناشر لأي محتوى يتم نشره عبر الموقع أو من خلال أي خاصية متاحة للتواصل عبر الموقع.</li>
 	<li>أنت تعلم وتقر بالموافقة على إعفاء موقع " كافور من أي مسئولية تقع عن عمل الغير أثناء قيامنا بتقديم الخدمات لك.</li>
</ol>
<strong>سادسًا: حقوق التأليف والنشر</strong>
<ol>
 	<li>الموقع والأفكار المُعبَر عنها داخله، هي حقوق ملكية فكرية خالصة لنا، وأي تقليد أو اقتباس للموقع أو بعض خدماته (بما في ذلك الأفكار والنصوص والرموز والبرمجيات) يعد انتهاكًا لحقوق التأليف والنشر الخاصة بنا، وسنقوم معه باتخاذ كافة الإجراءات القانونية ضد مرتكب الانتهاكات المذكورة.</li>
 	<li>جميع المحتويات المضمنة أو المتاحة ضمن خدمات موقع "كافور مثل (النصوص والشعارات والصور والرسوم البيانية والتسجيلات الصوتية وأيقونات الأزرار والمحتويات الرقمية والمواد التي يتم إعادة تحميلها والبرمجيات وتجميع البيانات) هي ملك للموقع، وهي محمية من قِبل قوانين الجمهورية العربية السورية وقوانين حقوق التأليف والنشر الدولية.</li>
 	<li>تجميع كافة البيانات المدرجة في خدمات موقع كافور أو إتاحتها من قِبل أيًا من خدماتنا هو ملك حصري وخاص بموقع كافور ومحمية بموجب قوانين حقوق الطبع والنشر السورية والدولية وكذلك محمية بموجب الاتفاقيات الدولية السارية، مثل اتفاقية برن، واتفاقية تربس.</li>
</ol>
<strong>سابعًا: العلامات التجارية</strong>
<ol>
 	<li>"كافور caphore" و"كافور.اس واي  sy" والشعارات المرتبطة به هي علامات تجارية و/أو علامات خدمة خاصة بنا.</li>
 	<li>الصور والشعارات ورؤوس الصفحات وأيقونات الأزرار والنصوص والأسماء الخدمية هي علامات تجارية وتصميمات تجارية خاصة بموقع كافور.</li>
 	<li>يحظر إعادة إنتاج العلامات أو التصميمات التجارية الخاصة بموقع كافور في أي وسيلة إعلامية أو إعلانية دون إذن كتابي منا.</li>
 	<li>لا يجوز استخدام العلامات والتصميمات التجارية الخاصة بموقع كافور في اتصال بأي منتج أو خدمة ليست تابعة لنا، حتى لا تتسبب في النيل من قدر ومصداقية بموقع كافور أو النيل من عملائه.</li>
</ol>
<strong>ثامنًا: التراخيص الممنوحة</strong>
<ol>
 	<li>يمنحك الموقع ترخيصًا محدودًا وغير حصري لاستخدام موقع كافور.</li>
 	<li>يحظر عليك التنازل عن الترخيص لصالح الغير أو تفويض الغير من الباطن دون موافقة الموقع.</li>
 	<li>نمنحك الترخيص في حدود الاستخدام غير التجاري لخدماتنا، وبالتالي يحظر عليك استخدام الموقع أو أي من خدماته استخدامًا تجاريًا دون موافقتنا.</li>
 	<li>لا يشمل هذا الترخيص إعادة بيع أو أي استخدام تجاري لأي من خدماتنا أو محتوياتها.</li>
 	<li>لا يشمل هذا الترخيص أي نسخ للمعلومات المتوفرة عن الحساب لصالح الغير، أو أي استخدام لوسائل استخراج البيانات أو أي استخدام لأدوات جمع واستخلاص البيانات المماثلة.</li>
 	<li>لا يجوز لك إعادة إنتاج أو عمل نسخة مطابقة لهذا الموقع، أو نسخ أو بيع أو إعادة بيع أي جزء منه، أو استخدامه بصورة مغايرة في أغراض الاستغلال التجاري أو غير التجاري له دون الحصول على موافقة كتابية صريحة من موقع كافور.</li>
 	<li>لا يجوز لك استخدام أي علامات وصفية أو أي "نص مخفي" آخر يستغل اسم موقع كافور أو علاماته التجارية بدون موافقة كتابية صريحة من الموقع.</li>
 	<li>غير مرخص لك بأي شكل من الأشكال نشر أي روابط لمواقع أو تطبيقات أخرى عبر الموقع أو من خلال أي خواص متاحة داخل الموقع.</li>
 	<li>يجوز لك استخدام خدماتنا بالشكل المسموح به قانونًا فقط، ووفقًا لشروط هذه الاتفاقية.</li>
 	<li>لا يجوز لك إساءة استخدام خدماتنا بأي شكل من الأشكال.</li>
 	<li>تنتهي التراخيص الممنوحة من قِبلنا إذا لم تلتزم بشروط الاستخدام هذه أو أي شروط خدمة أخرى.</li>
 	<li>جميع الحقوق غير الممنوحة لك صراحة في شروط الاستخدام هذه أو أي شروط خدمة أخرى يحتفظ بها موقع "كافور.كوم".</li>
</ol>
<strong>تاسعًا: حدود مسئوليتنا</strong>
<ol>
 	<li>نقدم خدماتنا "كما هي متوفرة"، دون أي تعهدات أو ضمانات من أي نوع، سواء صريحة أو ضمنية، تتعلق باستخدام هذا الموقع.</li>
 	<li>موقع كافور لا يقدم أي ضمانات بخلو هذا الموقع أو الخوادم الخاصة به أو الرسائل المُرسلة من الفيروسات أو غيرها من المكونات الضارة.</li>
 	<li>موقع كافور غير مسئول قانونًا عن الخسائر أو الأضرار أيًا كان نوعها التي قد تنشأ عن استخدام هذا الموقع بما في ذلك الأضرار المباشرة وغير المباشرة.</li>
 	<li>تقع مسئولية استخدام المعلومات التي يتلقاها أو يتوصل إليها المستخدم من خلال خدمات موقع كافور أو الاعتماد عليها على عاتق هذا المستخدم بشكل كامل.</li>
 	<li>تقر بأن موقع كافور عبارة عن خدمة قائمة على الانترنت، وأنه على الرغم من بذلنا أقصى جهد للحفاظ على المعلومات وإبقائها آمنة، إلا أننا لا نستطيع أن نضمن أن تكون المعلومات التي يتلقاها المستخدم أو يقوم ببثها أثناء استخدامه للموقع آمنة في كل الأوقات.</li>
 	<li>موقع كافور لا يستطيع أن يؤكد أن كل مستخدم للموقع هو فعلاً الشخص الذي يدعيه.</li>
 	<li>قد نقوم في أي وقت بتعديل أو وقف أو قطع خدمات موقع كافور بدون إرسال إخطار إليك بذلك، كما قد نقوم بوقف استخدامك لخدماتنا إذا قمت بانتهاك هذه الشروط والبنود أو إذا أسأت استخدام هذه الخدمات من وجهة نظرنا.</li>
 	<li>لن يكون موقع كافور ومسئوليه وموظفيه مسئولين قانونًا تجاهك أو تجاه أي طرف آخر عن أي خسارة مباشرة أو غير مباشرة أو عن أي تكلفة أخرى قد تنشأ من أو فيما يتصل بتنفيذ اتفاقية الاستخدام، أو فيما يتصل بتقديم خدماتنا.</li>
 	<li>على المستخدم أن يحمي الموقع وموظفيه وأن يدافع عنهم ويعوضهم عن أية خسائر ناتجة عن أية دعوى أو مطالبة تتعلق بالموقع أو ناتجة عن عمل أو إهمال من قِبل المستخدم أو ممثليه أو وكلائه.</li>
 	<li>مع عدم الإخلال بحقوقه الأخرى فان للموقع الحق في وقف أو إلغاء عضويتك أو وصولك إلى الموقع في أي وقت وبدون إنذار ولأي سبب، ودون تحديد، ويمكنه إلغاء اتفاقية المستخدم هذه.</li>
</ol>
<strong>عاشرًا: المسئولية القانونية لأطراف الاتفاقية</strong>
<ol>
 	<li>أنت توافق صراحة على أنك تستخدم موقع كافور على مسئوليتك الشخصية.</li>
 	<li>يجب عليك الالتزام بجميع القوانين واللوائح المعمول بها داخل الدولة التي تستخدم الموقع من خلالها وذلك فيما يتعلق باستخدامك للموقع، وتتحمل كافة المسئوليات الناشئة في حالة إخلالك بهذه القوانين أو اللوائح، كما تلتزم بجميع الشروط والأحكام المنصوص عليها في هذه الاتفاقية.</li>
 	<li>أنت مسئولاً عن المحافظة على استخدام الموقع بكل جدية ومصداقية وتكون ملزمًا بالتعويض عن أي خسائر أو أضرار  قد تلحق بالموقع نتيجة أي استخدام غير شرعي أو غير مفوض من قِبلنا.</li>
 	<li>أنت توافق على عدم استخدام موقع كافور أو أي خدمة تقدم من خلاله بطريقة غير قانونية أو احتيالية أو معادية للمجتمع على النحو الذي نقدره.</li>
 	<li>أنت توافق على عدم إرسال أي رسائل تتسم بالتمييز العنصري أو تحتوي على سب وقذف أو ألفاظ نابية أو صور خليعة أو فاحشة، أو تتسم بوجه عام بالانحطاط.</li>
 	<li>في حالة مخالفة المستخدم لأي من شروط أو أحكام هذه الاتفاقية فيكون من حق موقع كافور اتخاذ إجراء إداري داخل الموقع يتمثل في وقف العضوية لفترة من الزمن أو عمل حظر دائم للمستخدم المخالف، ولا يحق له في هذه الحالة التسجيل في الموقع مرة أخرى إلا بموافقة صريحة من الموقع.</li>
 	<li>لا تنال العقوبات التي يقوم موقع كافور بفرضها على أطراف هذه الاتفاقية من حق الموقع في اتخاذ كافة الإجراءات القانونية التي يراها مناسبة وفقًا لتقديره.</li>
 	<li>أنت توافق على تعويض موقع كافور وإبراء مسئوليته والدفاع عنه ضد كافة الدعاوى والمطالبات التي قد يرفعها أو يطالب بها الغير نتيجة استخدامك للموقع، أو بسبب قيامك بانتهاك هذه الشروط والبنود أو بالإخلال بحقوق المستخدمين الآخرين.</li>
 	<li>إذا قمت بانتهاك اتفاقية المستخدم هذه، فإن موقع كافور يحتفظ بحقه في استعادة أية مبالغ مستحقة عليك، وأي خسائر أو أضرار تسببت فيها وللموقع الحق في اتخاذ الإجراءات القانونية أو اللجوء للمحاكم المختصة لرفع دعاوى مدنية أو جنائية ضدك.</li>
 	<li>موقع كافور لا يضمن اتخاذه إجراءات ضد كل الانتهاكات التي قد تحدث لاتفاقية الاستخدام هذه، ولا يعني عدم اتخاذنا للإجراءات القانونية في أي من حالات الانتهاك تنازلاً عن حقنا في اتخاذ هذه الإجراءات في أي وقت نراه مناسبًا.</li>
 	<li>أنت تقر بأنك سوف تقوم بإخطارنا في حالة وجود أي منشورات أو مواد أو معاملات يبدو أنها تنتهك اتفاقية الاستخدام.</li>
</ol>
<strong>حادي عشر: تحويل الحقوق والالتزامات</strong>
<ol>
 	<li>يحق لموقع كافور تحويل كافة حقوقه الواردة في هذه الاتفاقية للغير دون أي اعتراض من المستخدم، ويلتزم الجميع بتنفيذ كافة التزاماتهم الواردة في هذه الاتفاقية قِبل المحال إليه فور إخطارهم بالحوالة، ويحق للمحال إليه اتخاذ كافة الإجراءات القانونية قِبل المتقاعس عن تنفيذ التزاماته بموجب هذه الاتفاقية.</li>
 	<li>لا يجوز لك التنازل عن التزاماتك وحقوقك بموجب هذه الاتفاقية، أو أن تعهد بإدارة حسابك بالموقع إلى طرف ثالث إلا بعد الحصول على موافقة خطية منا.</li>
</ol>
<strong>ثاني عشر: التعديلات</strong>
<ol>
 	<li>يلتزم المستخدم بما يجريه الموقع من تغييرات وتعديلات في السياسات المطبقة وعليه قبول أيه تعديلات يراها موقع كافور لازمة.</li>
 	<li>يجوز لنا في أي وقت إجراء أية تعديلات أو تحسينات نراها ضرورية على الموقع لزيادة فاعليته، ويلتزم المستخدم بأية توجيهات أو تعليمات يقدمها الموقع إليه في هذا الخصوص.</li>
 	<li>لا يجوز لك تغيير أي بنود من هذا الاتفاق أو تعديلها أو استبدالها بدون موافقة مكتوبة من موقع "كافور.كوم".</li>
 	<li>يجوز لنا تعديل أو تحديث هذه الشروط والأحكام "اتفاقية المستخدم" الخاصة باستخدام الموقع بدون إرسال إخطار إليك بذلك؛ لذا عليك مراجعة هذه الاتفاقية بشكل دوري.</li>
 	<li>أنت توافق على الالتزام بكافة الشروط والبنود الإضافية التي ستتاح لك والتي تتعلق باستخدام أي من الخدمات المتاحة عبر الموقع، ويتم دمج هذه الشروط والبنود الإضافية إلى هذه الاتفاقية.</li>
</ol>
<strong>ثالث عشر: إلغاء الاتفاق</strong>

يعتبر الاتفاق مفسوخًا من تلقاء ذاته دون حاجة إلى أعذار أو اتخاذ إجراءات قضائية في أي من الحالات الآتية
<ol>
 	<li>في حالة ثبوت قيامك بالإخلال بأي فقرة أو بند من بنود هذه الاتفاقية أعلاه، مع حفظ كافة حقوقنا في المطالبة بالتعويض عن الأضرار المترتبة على ذلك.</li>
 	<li>التنازل عن الحساب أو تأجيره من الباطن دون موافقتنا.</li>
 	<li>تقاعس المستخدم عن الوفاء بأية التزامات منصوص عليها في هذه الاتفاقية دون أن يتخذ إجراءات جدية لإزالة هذا الإخلال، مع الاحتفاظ بحقنا في المطالبة بالتعويضات إن كان لها محل.</li>
 	<li>عدم التمكن من توثيق أي معلومات قمت بتزويدنا بها.</li>
 	<li>إذا قررنا في أي وقت أن نشاطاتك قد تتسبب لك أو لمستخدمين آخرين في نزاعات قانونية.</li>
 	<li>توقف نشاط الوسيط الإلكتروني، أو توقف نشاط المسئولين عن إدارة الوسيط الإلكتروني.</li>
</ol>
<strong>رابع عشر: الضرائب والرسوم</strong>
<ol>
 	<li>لا يفرض موقع كافور رسومًا على التصفح والمزادات وشراء المنتجات المدرجة على الموقع.</li>
 	<li>يلتزم المستخدم بدفع كافة الضرائب المفروضة على الخدمات والمنتجات.</li>
 	<li>يلتزم المستخدم بدفع رسوم شركات الاتصالات بهدف الحصول على البيانات الخاصة بالوصول إلى شبكة الانترنت.</li>
</ol>
<strong> </strong>

<strong> </strong>

<strong>سادس عشر: القانون واجب التطبيق والمحاكم المختصة</strong>
<ol>
 	<li>يحكم هذه الاتفاقية القوانين المعمول بها والسارية المفعول داخل الجمهورية العربية السورية.</li>
 	<li>يختص القضاء داخل الجمهورية العربية السورية بأي نزاع قد ينشأ عن تفسير أو تنفيذ أحكام هذه الاتفاقية.</li>
 	<li>في حال أصبح أي حكم من أحكام هذه الاتفاقية غير ساري أو غير قانوني أو غير قابل للتنفيذ، فان قانونية وقابلية تنفيذ الأحكام الأخرى لن تتأثر بأي طريقة كانت بذلك الحكم.</li>
</ol>
<strong>سابع عشر: الطبيعة القانونية للشروط والأحكام والسياسات</strong>
<ol>
 	<li>تعد هذه الاتفاقية وملحقاتها الاتفاق الكامل والنهائي بين موقع كافور من ناحية، وأي شخص يقوم بزيارة الموقع أو يستخدمه أو يستخدم أي من خصائصه أو ميزاته من ناحية أخرى.</li>
 	<li>تعد هذه الاتفاقية عقدًا صحيحًا مكتملاً الشروط والأركان القانونية، نافذًا في مواجهة جميع الأطراف المذكورة، وأحكامه والتزاماته ملزمة لهم جميعًا.</li>
</ol>''';
    return SafeArea(
      child: Scaffold(
        body: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.symmetric(horizontal: 5.w,vertical: 10.h),
            child: RichText(
              text: HTML.toTextSpan(context,html),
              //...
            ),
          ),
        ),
      ),
    );
  }
}
